genestealer/everblu-meters-esp8266-improved/ESPHOME/components/everblu_meter/everblu_meter.cpp
/**
 * @file everblu_meter.cpp
 * @brief Implementation of ESPHome component for EverBlu Cyble Enhanced meters
 */

#include "everblu_meter.h"
#include "esphome/core/log.h"

#ifdef USE_ESP8266
#include <ESP8266WiFi.h>
#elif defined(USE_ESP32)
#include <WiFi.h>
#endif

namespace esphome
{
    namespace everblu_meter
    {

        static const char *const TAG = "everblu_meter";

        void EverbluMeterTriggerButton::press_action()
        {
            if (parent_ == nullptr)
            {
                ESP_LOGW(TAG, "Trigger button pressed but parent not set");
                return;
            }

            if (is_frequency_scan_)
            {
                parent_->request_frequency_scan();
            }
            else
            {
                parent_->request_manual_read();
            }
        }

        void EverbluMeterComponent::setup()
        {
            ESP_LOGCONFIG(TAG, "Setting up EverBlu Meter...");

            // Create config provider and configure it
            config_provider_ = new ESPHomeConfigProvider();
            config_provider_->setMeterYear(meter_year_);
            config_provider_->setMeterSerial(meter_serial_);
            config_provider_->setMeterType(is_gas_);
            config_provider_->setGasVolumeDivisor(gas_volume_divisor_);
            config_provider_->setFrequency(frequency_);
            config_provider_->setAutoScanEnabled(auto_scan_);
            config_provider_->setReadingSchedule(reading_schedule_.c_str());
            config_provider_->setReadHourUTC(read_hour_);
            config_provider_->setReadMinuteUTC(read_minute_);
            config_provider_->setTimezoneOffsetMinutes(timezone_offset_);
            config_provider_->setAutoAlignReadingTime(auto_align_time_);
            config_provider_->setUseAutoAlignMidpoint(auto_align_midpoint_);
            config_provider_->setMaxRetries(max_retries_);
            config_provider_->setRetryCooldownMs(retry_cooldown_ms_);

            // Create time provider
            if (time_component_ != nullptr)
            {
                time_provider_ = new ESPHomeTimeProvider(time_component_);
            }
            else
            {
                ESP_LOGW(TAG, "No time component configured, some features may not work correctly");
                time_provider_ = new ESPHomeTimeProvider(nullptr);
            }

            // Create data publisher and link all sensors
            data_publisher_ = new ESPHomeDataPublisher();
            data_publisher_->set_volume_sensor(volume_sensor_);
            data_publisher_->set_battery_sensor(battery_sensor_);
            data_publisher_->set_counter_sensor(counter_sensor_);
            data_publisher_->set_rssi_sensor(rssi_sensor_);
            data_publisher_->set_rssi_percentage_sensor(rssi_percentage_sensor_);
            data_publisher_->set_lqi_sensor(lqi_sensor_);
            data_publisher_->set_lqi_percentage_sensor(lqi_percentage_sensor_);
            data_publisher_->set_time_start_sensor(time_start_sensor_);
            data_publisher_->set_time_end_sensor(time_end_sensor_);
            data_publisher_->set_total_attempts_sensor(total_attempts_sensor_);
            data_publisher_->set_successful_reads_sensor(successful_reads_sensor_);
            data_publisher_->set_failed_reads_sensor(failed_reads_sensor_);
            data_publisher_->set_status_sensor(status_sensor_);
            data_publisher_->set_error_sensor(error_sensor_);
            data_publisher_->set_radio_state_sensor(radio_state_sensor_);
            data_publisher_->set_timestamp_sensor(timestamp_sensor_);
            data_publisher_->set_history_sensor(history_sensor_);
            data_publisher_->set_active_reading_sensor(active_reading_sensor_);
            data_publisher_->set_radio_connected_sensor(radio_connected_sensor_);

            // Quick diagnostic: report how many sensors were linked
            int numeric = 0;
            numeric += (volume_sensor_ != nullptr);
            numeric += (battery_sensor_ != nullptr);
            numeric += (counter_sensor_ != nullptr);
            numeric += (rssi_sensor_ != nullptr);
            numeric += (rssi_percentage_sensor_ != nullptr);
            numeric += (lqi_sensor_ != nullptr);
            numeric += (lqi_percentage_sensor_ != nullptr);
            numeric += (time_start_sensor_ != nullptr);
            numeric += (time_end_sensor_ != nullptr);
            numeric += (total_attempts_sensor_ != nullptr);
            numeric += (successful_reads_sensor_ != nullptr);
            numeric += (failed_reads_sensor_ != nullptr);

            int texts = 0;
            texts += (status_sensor_ != nullptr);
            texts += (error_sensor_ != nullptr);
            texts += (radio_state_sensor_ != nullptr);
            texts += (timestamp_sensor_ != nullptr);
            texts += (history_sensor_ != nullptr);

            int binaries = 0;
            binaries += (active_reading_sensor_ != nullptr);
            binaries += (radio_connected_sensor_ != nullptr);

            ESP_LOGD(TAG, "Linked sensors -> numeric: %d, text: %d, binary: %d", numeric, texts, binaries);

            // Create meter reader with all adapters (but don't initialize yet)
            meter_reader_ = new MeterReader(config_provider_, time_provider_, data_publisher_);

            // Initialize diagnostic binary sensors to a known state before HA connects
            // Set radio as unavailable (disconnected) until meter init completes
            if (data_publisher_)
            {
                data_publisher_->publishRadioState("unavailable");
            }

            ESP_LOGCONFIG(TAG, "EverBlu Meter setup complete (meter initialization deferred until WiFi connected)");
        }

        void EverbluMeterComponent::republish_initial_states()
        {
            if (!meter_reader_ || !meter_initialized_)
            {
                ESP_LOGW(TAG, "Cannot republish states: meter_initialized=%d, meter_reader=%p", meter_initialized_, meter_reader_);
                return;
            }

            ESP_LOGD(TAG, "Republishing initial states for Home Assistant...");

            // Republish status sensors that were sent before HA connected
            if (data_publisher_)
            {
                ESP_LOGD(TAG, "Publishing: radio state=Idle");
                data_publisher_->publishRadioState("Idle");

                ESP_LOGD(TAG, "Publishing: status=Ready");
                data_publisher_->publishStatusMessage("Ready");

                ESP_LOGD(TAG, "Publishing: error=None");
                data_publisher_->publishError("None");

                ESP_LOGD(TAG, "Publishing: active_reading=false");
                data_publisher_->publishActiveReading(false);

                ESP_LOGD(TAG, "Publishing: statistics (0, 0, 0)");
                data_publisher_->publishStatistics(0, 0, 0);

                ESP_LOGD(TAG, "Republish complete");
            }
            else
            {
                ESP_LOGW(TAG, "Cannot republish: data_publisher is null");
            }
        }

        void EverbluMeterComponent::loop()
        {
            // Initialize meter reader once WiFi is connected (deferred from setup)
            if (!meter_initialized_ && meter_reader_ != nullptr)
            {
#ifdef USE_ESP32
                if (WiFi.status() == WL_CONNECTED)
#else
                if (WiFi.isConnected())
#endif
                {
                    // Start a short grace period to ensure WiFi component finishes its own 'Connected' logging
                    if (wifi_ready_at_ == 0)
                    {
                        wifi_ready_at_ = millis();
                        ESP_LOGD(TAG, "WiFi connected, starting grace period before meter init...");
                        return;
                    }

                    // Wait ~500ms non-blocking before initializing (avoids log interleaving with WiFi)
                    if ((millis() - wifi_ready_at_) < 500)
                    {
                        return;
                    }

                    ESP_LOGI(TAG, "Initializing meter reader after WiFi readiness...");
                    meter_reader_->begin();
                    meter_initialized_ = true;
                    ESP_LOGI(TAG, "Meter reader initialized");
                }
                else
                {
                    // Still waiting for WiFi, skip rest of loop
                    return;
                }
            }

            // Let the meter reader handle its periodic tasks
            if (meter_reader_ != nullptr && meter_initialized_)
            {
#ifdef USE_API
                // Republish initial states when Home Assistant connects
                // (initial publishes may happen before HA is ready to receive)
                // Use is_connected(true) to check for state subscription (HA actively monitoring)
                if (esphome::api::global_api_server != nullptr)
                {
                    bool is_ha_connected = esphome::api::global_api_server->is_connected(true);
                    if (is_ha_connected && !last_api_client_count_)
                    {
                        ESP_LOGI(TAG, "Home Assistant connected, republishing initial states...");
                        republish_initial_states();
                        if (meter_reader_ != nullptr)
                        {
                            meter_reader_->setHAConnected(true);
                        }
                        last_api_client_count_ = true;
                    }
                    else if (!is_ha_connected)
                    {
                        if (meter_reader_ != nullptr)
                        {
                            meter_reader_->setHAConnected(false);
                        }
                        last_api_client_count_ = false;
                    }
                }
#endif

                // Optionally kick off a first read once time is synced so users see data without waiting
                // Controlled by initial_read_on_boot_ (default: disabled to avoid boot-time blocking when meter is absent)
                if (initial_read_on_boot_ && !initial_read_triggered_ && time_provider_ != nullptr && time_provider_->isTimeSynced())
                {
                    initial_read_triggered_ = true;
                    meter_reader_->triggerReading(false);
                }

                meter_reader_->loop();
            }
        }

        void EverbluMeterComponent::request_manual_read()
        {
            if (meter_reader_ == nullptr)
            {
                ESP_LOGW(TAG, "Manual read ignored: meter reader not ready");
                return;
            }

            ESP_LOGI(TAG, "Manual read requested via button");
            meter_reader_->triggerReading(false);
        }

        void EverbluMeterComponent::request_frequency_scan()
        {
            if (meter_reader_ == nullptr)
            {
                ESP_LOGW(TAG, "Frequency scan ignored: meter reader not ready");
                return;
            }

            ESP_LOGI(TAG, "Frequency scan requested via button");
            meter_reader_->performFrequencyScan(false);
        }

        void EverbluMeterComponent::update()
        {
            // This is called according to the update_interval
            // The meter reader handles its own scheduling via loop()
            // This method is here to satisfy ESPHome's PollingComponent interface
            // but the actual work happens in loop()
        }

        void EverbluMeterComponent::dump_config()
        {
            ESP_LOGCONFIG(TAG, "EverBlu Meter:");
            ESP_LOGCONFIG(TAG, "  Meter Year: %u", meter_year_);
            ESP_LOGCONFIG(TAG, "  Meter Serial: %u", meter_serial_);
            ESP_LOGCONFIG(TAG, "  Meter Type: %s", is_gas_ ? "Gas" : "Water");
            if (is_gas_)
            {
                ESP_LOGCONFIG(TAG, "  Gas Volume Divisor: %d", gas_volume_divisor_);
            }
            ESP_LOGCONFIG(TAG, "  Frequency: %.2f MHz", frequency_);
            ESP_LOGCONFIG(TAG, "  Auto Scan: %s", auto_scan_ ? "Enabled" : "Disabled");
            ESP_LOGCONFIG(TAG, "  Reading Schedule: %s", reading_schedule_.c_str());
            ESP_LOGCONFIG(TAG, "  Read Time: %02d:%02d", read_hour_, read_minute_);
            ESP_LOGCONFIG(TAG, "  Timezone Offset: %d", timezone_offset_);
            ESP_LOGCONFIG(TAG, "  Auto Align Time: %s", auto_align_time_ ? "Enabled" : "Disabled");
            ESP_LOGCONFIG(TAG, "  Auto Align Midpoint: %s", auto_align_midpoint_ ? "Enabled" : "Disabled");
            ESP_LOGCONFIG(TAG, "  Max Retries: %d", max_retries_);
            ESP_LOGCONFIG(TAG, "  Retry Cooldown: %lu ms", retry_cooldown_ms_);
            ESP_LOGCONFIG(TAG, "  Initial Read On Boot: %s", initial_read_on_boot_ ? "Enabled" : "Disabled");

            ESP_LOGCONFIG(TAG, "  Sensors:");
            LOG_SENSOR("    ", "Volume", volume_sensor_);
            LOG_SENSOR("    ", "Battery", battery_sensor_);
            LOG_SENSOR("    ", "Counter", counter_sensor_);
            LOG_SENSOR("    ", "RSSI", rssi_sensor_);
            LOG_SENSOR("    ", "RSSI Percentage", rssi_percentage_sensor_);
            LOG_SENSOR("    ", "LQI", lqi_sensor_);
            LOG_SENSOR("    ", "LQI Percentage", lqi_percentage_sensor_);
            LOG_SENSOR("    ", "Time Start", time_start_sensor_);
            LOG_SENSOR("    ", "Time End", time_end_sensor_);
            LOG_SENSOR("    ", "Total Attempts", total_attempts_sensor_);
            LOG_SENSOR("    ", "Successful Reads", successful_reads_sensor_);
            LOG_SENSOR("    ", "Failed Reads", failed_reads_sensor_);
            LOG_TEXT_SENSOR("    ", "Status", status_sensor_);
            LOG_TEXT_SENSOR("    ", "Error", error_sensor_);
            LOG_TEXT_SENSOR("    ", "Radio State", radio_state_sensor_);
            LOG_TEXT_SENSOR("    ", "Timestamp", timestamp_sensor_);
            LOG_TEXT_SENSOR("    ", "History", history_sensor_);
            LOG_BINARY_SENSOR("    ", "Active Reading", active_reading_sensor_);
            LOG_BINARY_SENSOR("    ", "Radio Connected", radio_connected_sensor_);
        }

    } // namespace everblu_meter
} // namespace esphome
